tap "felixkratz/formulae"
tap "koekeishiya/formulae"
tap "nikitabobko/tap"
tap "oven-sh/bun"
# Distributed revision control system
brew "git"
# Audit git repos for secrets
brew "gitleaks"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Simple terminal UI for git commands
brew "lazygit"
# Platform built on V8 to build network applications
brew "node"
# OpenBSD freely-licensed SSH connectivity tools
brew "openssh"
# Custom macOS statusbar with shell plugin, interaction and graph support
brew "felixkratz/formulae/sketchybar"
# Simple hotkey-daemon for macOS.
brew "koekeishiya/formulae/skhd"
# A tiling window manager for macOS based on binary space partitioning.
brew "koekeishiya/formulae/yabai", args: ["HEAD"]
# Incredibly fast JavaScript runtime, bundler, transpiler and package manager - all in one.
brew "oven-sh/bun/bun"
# GPU-accelerated terminal emulator
cask "alacritty"
# Desktop password and login vault
cask "bitwarden"
# Web browser focusing on privacy
cask "brave-browser"
# Voice and text chat software
cask "discord"
cask "font-hack-nerd-font"
cask "font-sf-pro"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Keyboard customiser
cask "karabiner-elements"
# Team communication and collaboration software
cask "slack"
# Music streaming service
cask "spotify"
# Open-source media center
cask "stremio"
# Open-source code editor
cask "visual-studio-code"
# Multiplayer code editor
cask "zed"
vscode "aaron-bond.better-comments"
vscode "akamud.vscode-theme-onedark"
vscode "akamud.vscode-theme-onelight"
vscode "batisteo.vscode-django"
vscode "bradlc.vscode-tailwindcss"
vscode "charliermarsh.ruff"
vscode "christian-kohler.path-intellisense"
vscode "csstools.postcss"
vscode "dbaeumer.vscode-eslint"
vscode "docker.docker"
vscode "dsznajder.es7-react-js-snippets"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-rename-tag"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "gitlab.gitlab-workflow"
vscode "glenn2223.live-sass"
vscode "kisstkondoros.vscode-gutter-preview"
vscode "koichisasada.vscode-rdbg"
vscode "mechatroner.rainbow-csv"
vscode "mflo999.lintel"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.pylint"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vsliveshare.vsliveshare"
vscode "npv2k1.theme-dracula-gray"
vscode "oliversturm.fix-json"
vscode "pkief.material-icon-theme"
vscode "platformio.platformio-ide"
vscode "pranaygp.vscode-css-peek"
vscode "redhat.java"
vscode "ritwickdey.liveserver"
vscode "royaction.color-manager"
vscode "sburg.vscode-javascript-booster"
vscode "styled-components.vscode-styled-components"
vscode "stylelint.vscode-stylelint"
vscode "syler.sass-indented"
vscode "tobiasalthoff.atom-material-theme"
vscode "tomoki1207.pdf"
vscode "txpipe.aiken"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "xabikos.javascriptsnippets"
vscode "yoavbls.pretty-ts-errors"
